CSI API ETABS v1

# eAreaDesignOrientation Enumeration

---

The possible design orientations for a shell.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eAreaDesignOrientation

    Public Enumeration eAreaDesignOrientation

    Dim instance As eAreaDesignOrientation

    public enum class eAreaDesignOrientation

    type eAreaDesignOrientation

Members

| Member name| Value| Description
---|---|---|---
| Wall| 1|
| Floor| 2|
| Ramp_DO_NOT_USE| 3|
| Null| 4|
| Other| 5|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com